In [1]:
import numpy as np
import pandas as pd

# Series

In [2]:
#help(pd.Series)
s1=pd.Series([1, 2, 3])
s1

0    1
1    2
2    3
dtype: int64

# Dataframe

In [69]:
iris={
"Sepal_Length":[5.1,4.9,4.7,4.6,5  ,5.4,4.6,5  ],
"Sepal_Width": [3.5,3  ,3.2,3.1,3.6,3.9,3.4,3.4]
}

frame = pd.DataFrame(data = iris)
frame

   Sepal_Length  Sepal_Width
0           5.1          3.5
1           4.9          3.0
2           4.7          3.2
3           4.6          3.1
4           5.0          3.6
5           5.4          3.9
6           4.6          3.4
7           5.0          3.4

# 컬럼 추가 by Series

In [72]:
val = pd.Series([3.2, -1.5, -1.7], index = [1, 3, 5])
frame['x']=val
frame

   Sepal_Length  Sepal_Width    x
0           5.1          3.5  NaN
1           4.9          3.0  3.2
2           4.7          3.2  NaN
3           4.6          3.1 -1.5
4           5.0          3.6  NaN
5           5.4          3.9 -1.7
6           4.6          3.4  NaN
7           5.0          3.4  NaN
0           1.0          2.0  NaN

# Row 추가

In [71]:
r = pd.DataFrame(data=[[1.,2.,11.]], columns=["Sepal_Length","Sepal_Width","x"])
frame=frame.append(r)
frame

   Sepal_Length  Sepal_Width     x
0           5.1          3.5   NaN
1           4.9          3.0   3.2
2           4.7          3.2   NaN
3           4.6          3.1  -1.5
4           5.0          3.6   NaN
5           5.4          3.9  -1.7
6           4.6          3.4   NaN
7           5.0          3.4   NaN
0           1.0          2.0  11.0

# Multi Index

In [5]:
df3 = pd.DataFrame(np.array(range(1,21)).reshape((5,4)),
                    columns=[["A", "A", "B", "B"],
                             ["C1", "C2", "C1", "C2"]])
df3.columns.names = ["Cidx1", "Cidx2"]
df3

Cidx1   A       B
Cidx2  C1  C2  C1  C2
0       1   2   3   4
1       5   6   7   8
2       9  10  11  12
3      13  14  15  16
4      17  18  19  20

In [6]:
df4 = pd.DataFrame(np.array(range(1,25)).reshape((6,4)),
    columns=[["A", "A", "B", "B"],
             ["C", "D", "C", "D"]],
      index=[["M", "M", "M", "F", "F", "F"],
             ["id_" + str(i + 1) for i in range(3)] * 2])
df4.columns.names = ["Cidx1", "Cidx2"]
df4.index.names = ["Ridx1", "Ridx2"]
df4

Cidx1         A       B
Cidx2         C   D   C   D
Ridx1 Ridx2
M     id_1    1   2   3   4
      id_2    5   6   7   8
      id_3    9  10  11  12
F     id_1   13  14  15  16
      id_2   17  18  19  20
      id_3   21  22  23  24

In [7]:
df4[("B", "C")]

Ridx1  Ridx2
M      id_1      3
       id_2      7
       id_3     11
F      id_1     15
       id_2     19
       id_3     23
Name: (B, C), dtype: int64

In [8]:
df4["B"]

Cidx2         C   D
Ridx1 Ridx2
M     id_1    3   4
      id_2    7   8
      id_3   11  12
F     id_1   15  16
      id_2   19  20
      id_3   23  24

# Dataframe etc

In [9]:
import pandas as pd
print('\n'.join([s for s in dir(df4) if s.upper().find('sw'.upper()) >= 0 ]))

swapaxes
swaplevel

In [10]:
data = { 'state':['ohio', 'ohio', 'ohio', 'nevada', 'nevada'], \
        'year'  :[2000,2001, 2002, 2001, 2002],                \
        'pop'   : [1.5, 1.7, 3.6, 2.4, 2.9] }
f = pd.DataFrame(data = data,index=('a','b','c','d','e'))        
f

    state  year  pop
a    ohio  2000  1.5
b    ohio  2001  1.7
c    ohio  2002  3.6
d  nevada  2001  2.4
e  nevada  2002  2.9

In [11]:
f.state

a      ohio
b      ohio
c      ohio
d    nevada
e    nevada
Name: state, dtype: object

In [12]:
f.loc['a','state']

'ohio'

In [13]:
f.loc[('a','b'),('state','pop')]

  state  pop
a  ohio  1.5
b  ohio  1.7

In [14]:
f.iloc[0:2,0:2 ]

  state  year
a  ohio  2000
b  ohio  2001

In [15]:
f.pop.__class__

method

# Dataframe Search

In [16]:
tab0 = {
     "c1" : [ "a", "a", "b", "b", "c", "c"],
     "val": [ 11,  12,  21,  22,  31,   32]
}
col0 = ["c1",  "val"]
df0 = pd.DataFrame(tab0,columns=col0)
#df0[df0.val<20]
df0.val<20

0     True
1     True
2    False
3    False
4    False
5    False
Name: val, dtype: bool

In [17]:
df0[df0.val<20]

  c1  val
0  a   11
1  a   12